[
  {
    "title": "The Sham",
    "subtitle": "Creature Field Guide",
    "link": null,
    "tags": ["Fiction", "Mythical Creatures"],
    "description": "Small bird, no more than two inches tall. Swarms together to build elaborate nests extremely quickly. Thousands of years ago it developed a method for camouflaging it’s nests by replicating objects and patterns in the nests surroundings. For example, if there was lots of fallen trees in a wooded area, it may choose to build a nest out of sticks, rocks and mud that looks like a fallen tree. Today, this translates into suburban homedwellers going to bed at night and waking up to a replica of their home next door made of sticks, rocks and mud. Or if you’ve ever noticed a row of mailboxes and one mailbox without a house, that is often the artwork of the Sham.",
    "img": null,
    "date": "Feb 13, 2020",
    "width": ""
  },
  {
    "title": "Prevent unnecessary re-render’s in React components",
    "subtitle": "The useEffect dependency array",
    "link": "https://medium.com/@joshknapp/prevent-unnecessary-re-renders-in-react-components-7130b966dad3",
    "tags": ["ReactJS", "software"],
    "description": null,
    "img": null,
    "date": "Feb 13, 2020",
    "width": ""
  },
  {
    "title": "The Fwelsh",
    "subtitle": "Creature Field Guide",
    "link": null,
    "tags": ["Fiction", "Mythical Creatures"],
    "description": "Peacock like bird. Unable to fly long distances. Translucent red/orangish feathers. When it sits, it becomes a small fire which can be very useful for camp-outs, but If not tended to, the fire will grow indefinitely and destroy anything in its path. The only way to stop the fire is to ignore it, then the bird will return to its original form and walk away.",
    "img": null,
    "date": "Feb 13, 2020",
    "width": ""
  },
  {
    "title": "My Dream Home (on wheels)",
    "subtitle": "A wish-list of features…",
    "link": "https://medium.com/@joshknapp/my-dream-home-on-wheels-bb59304fd686",
    "tags": ["VanLife"],
    "description": null,
    "img": 3,
    "date": "Jan 26, 2020",
    "width": ""
  },
  {
    "title": "The Snug",
    "subtitle": "Creature Field Guide",
    "link": null,
    "tags": ["Fiction", "Mythical Creatures"],
    "description": "Furry, fleshy, ball. No eyes, ears, or limbs. It feeds off of warmth. Makes a sort of subtle purring noise. Theoretically may never die unless it kills itself or another creature eats it. But it will continue to grow rapidly. Very delicious. Humans have continually tried to make them house pets but often fail due to the animals stupidity. It will tend to roll into the fireplace, onto a burning stove, into a hot bath, etc. they will congregate in large packs and lie like a pile of rocks, feeding off of each other’s warmth and the source of warmth they are on. Yellow snugs are extremely rare.",
    "img": null,
    "date": "Feb 13, 2020",
    "width": ""
  },
  {
    "title": "The Ballon",
    "subtitle": "Creature Field Guide",
    "link": null,
    "tags": ["Fiction", "Mythical Creatures"],
    "description": "Large, flat, oval shaped beetle. 3ft in diameter at maturity. Lives on the bottom of rivers. Commonly mistaken for rocks or boulders. It's exoskeleton is stronger than steel. During ancient war times distilled anise was often poured into the shallows of a river, and the ballon would congregate in that area. When picked up, soldiers would place the ballon on their forearm and it’s legs would latch on to the host. Creating an extremely effective battle shield.",
    "img": null,
    "date": "Feb 13, 2020",
    "width": ""
  },
  {
    "title": "All women are worth protecting",
    "subtitle": "Your ex-girlfriend, your barista, your mom, your friends friend, your mother-in-law, your step-sister, every one of them.",
    "link": "https://medium.com/the-magnificent-kingdom/all-women-are-worth-protecting-646a5a461896",
    "tags": ["Life", "Women"],
    "description": null,
    "img": null,
    "date": "Dec 26, 2018",
    "width": ""
  },
  {
    "title": "I’m now Trump’s OFFICIAL personal assistant!",
    "subtitle": null,
    "link": "https://medium.com/@joshknapp/im-now-trump-s-official-personal-assistant-a824b538681d",
    "tags": ["Fiction", "Politics"],
    "description": "Through a family friend, a young woman receives the honored role as Trump's personal assistant. Or so she thinks.",
    "img": 5,
    "date": "Jun 19, 2018",
    "width": ""
  },
  {
    "title": "The Invention of Sound",
    "subtitle": null,
    "link": "https://medium.com/the-magnificent-kingdom/the-invention-of-sound-34d36210c4a7",
    "tags": ["Fiction"],
    "description": "An old instrument builder living on the edge of a dense forest receives a letter from an unknown source, kicking off an adventure the world has always been waiting for.",
    "img": 1,
    "date": "May 23, 2018",
    "width": ""
  },
  {
    "title": "Beware of Falling Objects",
    "subtitle": "How it feels having your home-on-wheels deleted by a tree",
    "link": "https://medium.com/@joshknapp/beware-of-falling-objects-ff1995423d9a",
    "tags": ["Life"],
    "description": null,
    "img": 4,
    "date": "May 5, 2018",
    "width": ""
  }
]
